In [1]:
import pandas as pd
import numpy as np

path = 'dados/person.csv'


df = pd.read_csv(path)

df = df.drop(columns=['id', 'Unnamed: 0'])
df.head()

    age  gender  income  days_on_platform           city  purchases
0   NaN    Male  126895              14.0  San Francisco          0
1   NaN    Male  161474              14.0          Tokyo          0
2  24.0    Male  104723              34.0         London          1
3  29.0    Male   43791              28.0         London          2
4  18.0  Female  132181              26.0         London          2

In [2]:
df = df.rename(columns={
    "age": "idade",
    "gender": "genero",
    "income": "renda",
    "days_on_platform": "dias_na_plataforma",
    "city": "cidade",
    "purchases": "compras_realizadas"
    })

In [3]:
df["genero"] = df["genero"].replace({"Male": "M", "Female": "F"})
df = df.drop(columns=["idade"])

In [4]:
df["dias_na_plataforma"] = df["dias_na_plataforma"].fillna(0).astype("Float64")
df[(df['dias_na_plataforma'] > 100)]

     genero   renda  dias_na_plataforma         cidade  compras_realizadas
697       M   79483               103.0  San Francisco                   0
1964      F  166648               110.0         London                   1
2020      F   81893               106.0  New York City                   1
2069      M   22932               111.0         London                   1

In [10]:
df.to_csv("dados/pessoa.csv", index=False)